#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main(void)
{
	srand(time(NULL));
	int attemptCount = 0; // °ÔÀÓ ½Ãµµ È½¼ö
	int jackpotWins = 0; // 7-7-7 ÀèÆÌ È½¼ö (1ÀÌ µÇ¾úÀ» ¶§ °ÔÀÓ Á¾·á)
	int tripleWins = 0; // 7-7-7 ÀèÆÌ È½¼ö¸¦ Á¦¿ÜÇÑ Æ®¸®ÇÃ È½¼ö(¿¹½Ã: 3-3-3)
	int pairWins = 0; // 2°³¸¸ ÀÏÄ¡ÇÏ´Â È½¼ö (¿¹½Ã: 2-1-2)

	int coins = 50; // ÄÚÀÎÀ» 50°³ ±âº»À¸·Î °®°í ½ÃÀÛ
	const int COIN = 1; // °ÔÀÓ ÇÑ ÆÇ¿¡ »ç¿ëÇÒ ÄÚÀÎÀÇ ¼ö

	printf("=========================================================");
	printf("ÀèÆÌ °ÔÀÓÀ» ½ÃÀÛÇÕ´Ï´Ù! 7-7-7ÀÌ ³ª¿À¸é °ÔÀÓÀº Á¾·áµË´Ï´Ù.");
	printf("=========================================================");
	char playAgain = 'y'; // ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ (y: ï¿½ï¿½, n: ï¿½Æ´Ï¿ï¿½)
	char playAgain = 'y'; // ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ ï¿½ï¿½ï¿½ï¿½ (y: ï¿½ï¿½, n: ï¿½Æ´Ï¿ï¿½)

	while (jackpotWins == 0)
	{
		attemptCount += 1;
		printf("==============%dÈ¸ °ÔÀÓ==============\n", attemptCount);
		int num1 = (rand() % 7) + 1;
		int num2 = (rand() % 7) + 1;
		int num3 = (rand() % 7) + 1;
		printf("===%dÈ¸ °ÔÀÓ °á°ú: [%d] [%d] [%d]===\n", attemptCount, num1, num2, num3);

		if (num1 == 7 && num2 == 7 && num3 == 7)
		{
			// ÀèÆÌ (7-7-7)
			printf("<<-------%d-%d-%d ÀèÆÌ ¼º°ø!------->>\n", num1, num2, num3);
			printf("<<------°ÔÀÓ ½Ãµµ È½¼ö: %d\n------->>", attemptCount);
			jackpotWins += 1;
		}
		else if (num1 == num2 && num2 == num3) {
			// ÀèÆÌÀÌ ¾Æ´Ñ Æ®¸®ÇÃ (3-3-3, 5-5-5 µî..)
			printf("<<-------%d-%d-%d Æ®¸®ÇÃ!------->>\n", num1, num2, num3);
			tripleWins += 1;
		}
		else {
			printf("´ÙÀ½ ±âÈ¸¿¡..\n");
		} // end if
	}

	printf("=========================================================");
	printf("** ÀèÆÌ °ÔÀÓ °á°ú°¡ ³ª¿Ô½À´Ï´Ù! **\n");
	printf("---------------------------------------------------------");
	printf("ÀèÆÌÀÌ ³ª¿Ã ¶§±îÁö ÃÑ %d¹ø ½ÃµµÇß½À´Ï´Ù.\n\n", attemptCount);
	printf("----------------------´çÃ·µÈ ±â·Ï------------------------");
	printf("ÀèÆÌÀÌ ¾Æ´Ñ Æ®¸®ÇÃ (ex: 1-1-1): %d¹ø\n", tripleWins);
	printf("=========================================================");
	
	return 0;
}